In [2]:
import pandas as pd
df=pd.read_csv("Data.csv")
print(df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [14]:
slry=df['Salary'] ==83000
print(slry)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9    False
Name: Salary, dtype: bool

In [17]:
mulit=df.loc[(df['Salary']>50000) & (df['Country']=='Germany')]
print(mulit)

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
8  Germany  50.0  83000.0        No

In [4]:
#drop columns
import pandas as pd
df=pd.read_csv("Data.csv")

df.drop(labels='Age',axis=1)

   Country   Salary Purchased
0   France  72000.0        No
1    Spain  48000.0       Yes
2  Germany  54000.0        No
3    Spain  61000.0        No
4  Germany      NaN       Yes
5   France  58000.0       Yes
6    Spain  52000.0        No
7   France  79000.0       Yes
8  Germany  83000.0        No
9   France  67000.0       Yes

In [9]:
df['Id']='b200003'
df

   Country    Age   Salary Purchased     new_column       Id
0   France  888.0  72000.0        No  default_value  b200003
1    Spain   27.0  48000.0       Yes  default_value  b200003
2  Germany   30.0  54000.0        No  default_value  b200003
3    Spain   38.0  61000.0        No  default_value  b200003
4  Germany   40.0      NaN       Yes  default_value  b200003
5   France   35.0  58000.0       Yes  default_value  b200003
6    Spain    NaN  52000.0        No  default_value  b200003
7   France   48.0  79000.0       Yes  default_value  b200003
8  Germany   50.0  83000.0        No  default_value  b200003
9   France   37.0  67000.0       Yes  default_value  b200003

In [6]:
df.at[0,'Age']=888 
print(df)

   Country    Age   Salary Purchased
0   France  888.0  72000.0        No
1    Spain   27.0  48000.0       Yes
2  Germany   30.0  54000.0        No
3    Spain   38.0  61000.0        No
4  Germany   40.0      NaN       Yes
5   France   35.0  58000.0       Yes
6    Spain    NaN  52000.0        No
7   France   48.0  79000.0       Yes
8  Germany   50.0  83000.0        No
9   France   37.0  67000.0       Yes

In [11]:
data=(['A','B','C'],(1,2,3),(4,5,6),(7,8,9))
df=pd.Series(data)
df

0    [A, B, C]
1    (1, 2, 3)
2    (4, 5, 6)
3    (7, 8, 9)
dtype: object

In [13]:
data={
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}
num_data=pd.DataFrame(data)
num_data

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [16]:
def sum_series(x,y):
    return x+y
result=num_data.apply(lambda row: sum_series(row['A'],row['B']),axis=1)
print(result)

0    5
1    7
2    9
dtype: int64

In [23]:
import pandas as pd
df=pd.read_csv('Data.csv')
df['Country'].replace('Spain','India')

0     France
1      India
2    Germany
3      India
4    Germany
5     France
6      India
7     France
8    Germany
9     France
Name: Country, dtype: object